<template>
  <main class="read">
    <h2 class="container">Читаем вместе</h2>
    <div class="fairytales_list">
      <div class="fairytales_list_wrap" v-for="(bookArr, index) in chunk" :key="index">
        <div class="container">
          <article class="fairytale" v-for="book in bookArr" :key="book.id">
            <div class="fairytale_header">
              {{book.title}}
            </div>
            <div class="fairytale_description">
              <p><span class="fairytale_description__accent">Описание:</span>{{book.preview}}</p>
              <p><span class="fairytale_description__accent">Мораль:</span>{{book.morality}}</p>
            </div>
            <div class="fairytale_buttons">
              <button class="button__blue read__button" @click="showModal = true">Читать</button>
              <button class="button__blue print__button">Распечатать</button>
            </div>
            <div id="modal-template" v-if="showModal">
              <transition name="modal">
                <div class="modal-wrap">
                  <div class="modal_text">
                    jfdjkfjkdkf
                  </div>
                  <button class="modal-default-button" @click="showModal=false">
                    OK
                  </button>
                </div>

              </transition>
            </div>
          </article>
        </div>
      </div>

    </div>

  </main>
</template>

<script>
export default {
name: "readTogether",
  data() {
    return {
      showModal: false,
      booksPerBlock: 4,
      books: [
        {id:1, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:2, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:3, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:4, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:5, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:6, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:7, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:8, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:9, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:10, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:11, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:2, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:13, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:14, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:15, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:16, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},

      ],
    }
  },
  methods: {
    openBook() {
      this.popupIsOpen = true;
    },
    // closeBook() {
    //   this.popupIsOpen = false;
    // }
  },
  computed: {
    chunk () {
      const chunks = [];
      let i = 0;
      const n = this.books.length;
      while (i < n) {
        chunks.push(this.books.slice(i, i += this.booksPerBlock));
      }
      return chunks;
    }
  },
  mounted: {

  }
}
</script>

<style scoped>
.read h2 {
  position: relative;
  margin-top: 1em;
  text-align: center;
  margin-top: 15vh;
}
.read h2:after {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: 0%;
  right: 16%;
  height: 90px;
  width: 90px;
}
.fairytales_list {

}
.fairytales_list_wrap {
  /*display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  margin-bottom: 104px;
  position: relative;*/
}
.fairytales_list_wrap .container {
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  position: relative;
}
.fairytales_list_wrap:nth-child(odd) {
  background: url(./../assets/fairytalesWrapBg.png) no-repeat;
  background-size: 100% 100%;
  background-position: bottom;
  padding: 120px 0 70px;
}
.fairytales_list_wrap:nth-child(1)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/spring.svg) no-repeat;
  background-size: contain;
  bottom: -7%;
  right: 0%;
  height: 85px;
  width: 85px;
}
.fairytales_list_wrap:nth-child(2)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  top: -8%;
  left: 7%;
  height: 62px;
  width: 62px;
}
.fairytales_list_wrap:nth-child(2)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: -8%;
  left: 27%;
  height: 90px;
  width: 90px;
}
.fairytales_list_wrap:nth-child(3)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  top: -5%;
  right: 7%;
  height: 62px;
  width: 62px;
}
.fairytales_list_wrap:nth-child(3)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: -3%;
  left: 50%;
  height: 90px;
  width: 90px;
  transform: translate(-50%, -50%);
}
.fairytales_list_wrap:nth-child(4)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/spring2.svg) no-repeat;
  background-size: contain;
  top: 1%;
  left: 15%;
  height: 90px;
  width: 90px;
  transform: translate(-50%, -50%);
  z-index: -1;
}
.fairytales_list_wrap:nth-child(4)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  bottom: -8%;
  left: 42%;
  height: 62px;
  width: 62px;
}
.fairytale {
  box-sizing: border-box;
  width: 48%;
  padding: 45px;
  text-align: left;
  background: #FFFFFF;
  box-shadow: 0px 0px 10px rgba(0, 0, 0, 0.15);
  border-radius: 23px;
  margin-bottom: 38px;
  display: flex;
  flex-wrap: wrap;
  align-content: space-between;
}
.fairytale_header {
  font-family: Noteworthy;
  font-weight: bold;
  font-size: 28px;
  color: var(--headers-color);
  margin-bottom: 23px;
}
.fairytale_description {
  font-family: 'Noto Sans', sans-serif;
  margin-bottom: 60px;

}
.fairytale_description p{
  font-weight: normal;
  font-size: 16px;
  color: #000000;
}
.fairytale_description__accent {
  color: var(--accent-text-color);
}
.button__blue {
  color: #fff;
  background: #00AAE8;
  border-radius: 137px;
  border: none;
  font-size: 18px;
  cursor: pointer;
}
.print__button {
  padding: 15px 56px 15px 20px;
  background-image: url("./../assets/print.svg");
  background-repeat: no-repeat;
  background-position: top 45% right 10%;
}
.read__button {
  padding: 15px 56px 15px 36px;
  background-image: url("./../assets/book.svg");
  background-repeat: no-repeat;
  background-position: top 45% right 10%;
}
.fairytale_buttons {
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  width: 100%;
}
.fairytale_buttons .print__button,
.fairytale_buttons .read__button {
  width: 45%;
}
</style>