<template>
  <main class="read">
    <h2 class="container">Читаем вместе</h2>
    <div class="fairytales_list">
      <div class="fairytales_list_wrap" v-for="(bookArr, index) in chunk" :key="index">
        <div class="container">
          <article class="fairytale" v-for="book in bookArr" :key="book.id">
            <div class="fairytale_header">
              {{book.title}}
            </div>
            <div class="fairytale_description">
              <p><span class="fairytale_description__accent">Описание:</span>{{book.preview}}</p>
              <p><span class="fairytale_description__accent">Мораль:</span>{{book.morality}}</p>
            </div>
            <div class="fairytale_buttons">
              <button class="button__blue read__button" @click="bookText=book.text;bookTitle=book.title; showModal=true">Читать</button>
              <button class="button__blue print__button">Распечатать</button>
            </div>
          </article>
        </div>
      </div>

    </div>
    <div id="modal-template" v-if="showModal">
      <transition name="modal">
        <div class="modal-wrap" id="modal-wrap">
          <div class="modal_text" >
            <h3 v-text="bookTitle"></h3>
            <p v-text="bookText"></p>
          </div>
          <div class="modal-close-button" @click="showModal=false">
            <img src="./../assets/closeModal.svg" alt="">
          </div>
          <FairytalePagination v-model="page" :count="books.length" :per-page="bookInPage" />
          <!--<div class="modal-buttons">
            <div class="btn-left"><img src="./../assets/modalBtnLeft.svg" alt=""></div>
            <div class="btn-right"><img src="./../assets/modalBtnRight.svg" alt=""></div>
          </div>-->
        </div>
      </transition>
    </div>
  </main>
</template>

<script>
import FairytalePagination from '@/components/FairytalePagination'
export default {
name: "readTogether",
  components: {
    FairytalePagination
  },
  data() {
    return {
      showModal: false,
      booksPerBlock: 4,
      books: [
        {id:1, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:2, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:3, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:4, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:5, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:6, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:7, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:8, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:9, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:10, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:11, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:2, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:13, title: 'Бразильская сказка о Каипоре и черепахе', text: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', preview: 'Лесной дух Каипора хочет обхитрить черепаху и поймать ее, но она оказывается хитрее него.', morality:'смекалка и изобретательность порой гораздо важнее, чем физическая сила'},
        {id:14, title: 'Итальянская сказка. Кирпич и воск ', preview: 'Воск завидует крепости кирпича и по его совету залезает в огонь, но не обжигается, а плавится. Хозяин делает из воска куклу, которая рассказывает детям, что каждый хорош на своем месте.', morality:'каждый уникален и обладает своей сильной стороной. Не завидуйте другим', text: 'каждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другимкаждый уникален и обладает своей сильной стороной. Не завидуйте другим'},
        {id:15, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},
        {id:16, title: 'Португальская сказка. Принц с ослиными ушами', preview: 'Фея награждает наследного принца ослиными ушами, и только доказав свою честность и скромность, ему удается снять проклятье.', morality:'важно быть справедливым по отношению к другим, смелым и порядочным', text: 'важно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочнымважно быть справедливым по отношению к другим, смелым и порядочным'},

      ],
      bookText: '',
      bookTitle: '',
      page: 1,
      bookInPage: 1,
    }
  },
  computed: {
    chunk () {
      const chunks = [];
      let i = 0;
      const n = this.books.length;
      while (i < n) {
        chunks.push(this.books.slice(i, i += this.booksPerBlock));
      }
      return chunks;
    }
  },
  mounted: {

  },
}
</script>

<style scoped>
.read {
  position: relative;
}
.read h2 {
  position: relative;
  text-align: center;
  margin-top: 3em;
}
.read h2:after {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: 0%;
  right: 16%;
  height: 90px;
  width: 90px;
}
.fairytales_list {

}
#modal-template {
  position: fixed;
  background: rgba(0, 0, 0, 0.4);
  width: 100%;
  top: 0;
  left: 0;
  height: 100%;
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 999999;
}
.modal-wrap {
  width: 73.5vw;
  background: #FFFFFF;
  border-radius: 50px;
  height: 60vh;
  padding: 52px 93px 106px 113px;
  position: relative;
}
/*#modal-wrap :before {
  content: '';
  position: absolute;
  background-image: url("./../assets/Star_big1.png");
  background-repeat: no-repeat;
  width: 90px;
  height: 90px;
  bottom: 0;
  right: 0;
  transform: translate(-50%, -50%);
}*/
.modal-close-button  {
  position: absolute;
  top: -4%;
  right: -4%;
  cursor: pointer;
}
.modal-close-button img  {
  width: 100%;
  height: 100%;
  object-fit: contain;
}
.modal_text h3 {
  margin-bottom: 3vh;
}
.modal_text p {
  font-family: 'Noto Sans', sans-serif;
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  height: 33vh;
  overflow: auto;
}
.modal-buttons {
  position: absolute;
  top: 50%;
  display: flex;
  justify-content: space-between;
  width: 110%;
  left: -5%;
  transform: translate(0, -50%);
}
.btn-left,
.btn-right {
  height: 66px;
  width: 73px;
  cursor: pointer;
}
.btn-left img,
.btn-right img {
  height: 100%;
  width: 100%;
  object-fit: contain;
}
.fairytales_list_wrap {
  /*display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  margin-bottom: 104px;
  position: relative;*/
}
.fairytales_list_wrap .container {
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  position: relative;
}
.fairytales_list_wrap:nth-child(odd) {
  background: url(./../assets/fairytalesWrapBg.png) no-repeat;
  background-size: 100% 100%;
  background-position: bottom;
  padding: 120px 0 70px;
}
.fairytales_list_wrap:nth-child(1)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/spring.svg) no-repeat;
  background-size: contain;
  bottom: -7%;
  right: 0%;
  height: 85px;
  width: 85px;
}
.fairytales_list_wrap:nth-child(2)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  top: -8%;
  left: 7%;
  height: 62px;
  width: 62px;
}
.fairytales_list_wrap:nth-child(2)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: -8%;
  left: 27%;
  height: 90px;
  width: 90px;
}
.fairytales_list_wrap:nth-child(3)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  top: -5%;
  right: 7%;
  height: 62px;
  width: 62px;
}
.fairytales_list_wrap:nth-child(3)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/Star_big1.png) no-repeat;
  background-size: contain;
  top: -3%;
  left: 50%;
  height: 90px;
  width: 90px;
  transform: translate(-50%, -50%);
}
.fairytales_list_wrap:nth-child(4)>.container::before {
  content: '';
  position: absolute;
  background: url(./../assets/spring2.svg) no-repeat;
  background-size: contain;
  top: 1%;
  left: 15%;
  height: 90px;
  width: 90px;
  transform: translate(-50%, -50%);
  z-index: -1;
}
.fairytales_list_wrap:nth-child(4)>.container::after {
  content: '';
  position: absolute;
  background: url(./../assets/heart.svg) no-repeat;
  background-size: contain;
  bottom: -8%;
  left: 42%;
  height: 62px;
  width: 62px;
}
.fairytale {
  box-sizing: border-box;
  width: 48%;
  padding: 45px;
  text-align: left;
  background: #FFFFFF;
  box-shadow: 0px 0px 10px rgba(0, 0, 0, 0.15);
  border-radius: 23px;
  margin-bottom: 38px;
  display: flex;
  flex-wrap: wrap;
  align-content: space-between;
}
.fairytale_header {
  font-family: Noteworthy;
  font-weight: bold;
  font-size: 28px;
  color: var(--headers-color);
  margin-bottom: 23px;
}
.fairytale_description {
  font-family: 'Noto Sans', sans-serif;
  margin-bottom: 60px;

}
.fairytale_description p{
  font-weight: normal;
  font-size: 16px;
  color: #000000;
}
.fairytale_description__accent {
  color: var(--accent-text-color);
}
.button__blue {
  color: #fff;
  background: #00AAE8;
  border-radius: 137px;
  border: none;
  font-size: 18px;
  cursor: pointer;
}
.print__button {
  padding: 15px 56px 15px 20px;
  background-image: url("./../assets/print.svg");
  background-repeat: no-repeat;
  background-position: top 45% right 10%;
}
.read__button {
  padding: 15px 56px 15px 36px;
  background-image: url("./../assets/book.svg");
  background-repeat: no-repeat;
  background-position: top 45% right 10%;
}
.fairytale_buttons {
  display: flex;
  flex-wrap: wrap;
  justify-content: space-between;
  width: 100%;
}
.fairytale_buttons .print__button,
.fairytale_buttons .read__button {
  width: 45%;
}
</style>